DataProcessors/бит_ВыгрузкаРазовых.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ВыгрузкаРазовых</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/лб_ПредставлниеЗданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_ПредставлниеЗданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_НаправленияОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/бит_ВыгрузкаРазовых/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Разделитель = ";";
	СпособДетализации = 1;
	ЗаполнитьНачисления();
	ЗаполнитьУчастки();
	ЗаполнитьТипыКвартир();
	ЗаполнитьВидыОплат();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисления()
	
	Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_УслугиЖКХ.Ссылка КАК Начисление
		|ИЗ
		|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		|ГДЕ
		|	НЕ бит_УслугиЖКХ.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_УслугиЖКХ.Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаНачисления = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисления, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастки()
	
	Участки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_АдминистративныеОкруга.Ссылка КАК Участок
		|ИЗ
		|	Справочник.бит_АдминистративныеОкруга КАК бит_АдминистративныеОкруга
		|ГДЕ
		|	НЕ бит_АдминистративныеОкруга.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_АдминистративныеОкруга.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаУчастки = Участки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУчастки, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыКвартир()
	
	ТипыКвартир.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ТипыКвартиры.Ссылка КАК ТипКвартиры
		|ИЗ
		|	Справочник.бит_ТипыКвартиры КАК бит_ТипыКвартиры
		|ГДЕ
		|	НЕ бит_ТипыКвартиры.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ТипыКвартиры.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаТК = ТипыКвартир.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТК, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыОплат()
	
	ВидыОплат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_ВидыОплат.Ссылка КАК ВидОплаты
		|ИЗ
		|	Справочник.лб_ВидыОплат КАК лб_ВидыОплат
		|ГДЕ
		|	НЕ лб_ВидыОплат.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	лб_ВидыОплат.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаВО = ВидыОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаВО, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталогаИмпорта = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогаИмпорта.Заголовок = "Выберите каталог для выгрузки ";
	ДиалогВыбораКаталогаИмпорта.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогаИмпорта.Каталог = Каталог;
	
	Оповещение = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораКаталогаИмпорта.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Каталог = Результат[0];
	Иначе
		ПоказатьПредупреждение(,"Каталог не выбран!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", НачалоПериода, КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РезультатВыбора, "НачалоПериода,КонецПериода");

КонецПроцедуры

&НаКлиенте
Процедура Начисления_УстановитьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Начисления_СнятьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_УстановитьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_СнятьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_УстановитьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_СнятьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлCSV(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Сообщить("Не заполнен каталог!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Сообщить("Не заполнено начало периода!");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщить("Не заполнен конец периода!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не заполнена организация!");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеНаСервере();
	//Если Не ТаблицаИтог.Количество() = 0 Тогда
		СформироватьФайлXLSНаКлиенте();	
	//Иначе	
	//	Сообщить("Не найдены данные для сохранения в файл csv!");	
	//КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК LS,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Услуга,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор КАК Ссылка,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.НомерСтроки КАК НомерСтроки,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодСекунда КАК Период,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодМесяц КАК PER,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаПриход КАК Сумма,
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК F,
		|	ВЫБОР
		|		КОГДА бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры ЕСТЬ NULL
		|				ИЛИ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры = """"
		|			ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира
		|		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
		|	КОНЕЦ КАК NKV,
		|	ЕСТЬNULL(лб_ПредставлниеЗданий.Представление, бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание) КАК DOM,
		|	ВЫБОР
		|		КОГДА бит_СведенияОКвартиреСрезПоследних.Квартира.Подъезд ЕСТЬ NULL
		|				ИЛИ бит_СведенияОКвартиреСрезПоследних.Квартира.Подъезд = """"
		|			ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира.Подъезд
		|		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.Квартира.Подъезд
		|	КОНЕЦ КАК POD
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Авто,
		|			Организация = &Организация
		|				И УслугаЖКХ В (&Начисления)
		|				И 1 = 1
		|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
		|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание = лб_ПредставлниеЗданий.Здание
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.НомерСтроки,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодСекунда,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодМесяц,
		|	-бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаРасход,
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга),
		|	ВЫБОР
		|		КОГДА бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры ЕСТЬ NULL
		|				ИЛИ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры = """"
		|			ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира
		|		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
		|	КОНЕЦ,
		|	ЕСТЬNULL(лб_ПредставлниеЗданий.Представление, бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание),
		|	ВЫБОР
		|		КОГДА бит_СведенияОКвартиреСрезПоследних.Квартира.Подъезд ЕСТЬ NULL
		|				ИЛИ бит_СведенияОКвартиреСрезПоследних.Квартира.Подъезд = """"
		|			ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира.Подъезд
		|		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.Квартира.Подъезд
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Авто,
		|			Организация = &Организация
		|				И УслугаЖКХ В (&Начисления)
		|				И 1 = 1
		|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
		|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание = лб_ПредставлниеЗданий.Здание
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	МАКСИМУМ(бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо
		|ПОМЕСТИТЬ ВТ_ФИО
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|			,
		|			СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|				И ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						ВТ_Данные.LS КАК LS
		|					ИЗ
		|						ВТ_Данные КАК ВТ_Данные)) КАК бит_ПроживающиеПоЛССрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_РазовыеПоУслугамЖКХСписокУслуг.ЛицевойСчет КАК ЛицевойСчет,
		|	ЕСТЬNULL(бит_РазовыеПоУслугамЖКХ.ДокументНаПерерасчет.Наименование, """") КАК MAME,
		|	бит_РазовыеПоУслугамЖКХ.НачПериода КАК OT,
		|	бит_РазовыеПоУслугамЖКХ.КонПериода КАК DO,
		|	бит_РазовыеПоУслугамЖКХ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДокДоГруппировки
		|ИЗ
		|	Документ.бит_РазовыеПоУслугамЖКХ.СписокУслуг КАК бит_РазовыеПоУслугамЖКХСписокУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
		|		ПО бит_РазовыеПоУслугамЖКХСписокУслуг.Ссылка = бит_РазовыеПоУслугамЖКХ.Ссылка
		|ГДЕ
		|	бит_РазовыеПоУслугамЖКХ.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Данные.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_Данные КАК ВТ_Данные)
		|	И бит_РазовыеПоУслугамЖКХ.ЛицевойСчет = ЗНАЧЕНИЕ(справочник.бит_ЛицевыеСчета.)
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_РазовыеПоУслугамЖКХ.Ссылка,
		|	бит_РазовыеПоУслугамЖКХСписокУслуг.ЛицевойСчет,
		|	бит_РазовыеПоУслугамЖКХ.НачПериода,
		|	бит_РазовыеПоУслугамЖКХ.КонПериода,
		|	ЕСТЬNULL(бит_РазовыеПоУслугамЖКХ.ДокументНаПерерасчет.Наименование, """")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_РазовыеПоУслугамЖКХ.ЛицевойСчет,
		|	ЕСТЬNULL(бит_РазовыеПоУслугамЖКХ.ДокументНаПерерасчет.Наименование, """"),
		|	бит_РазовыеПоУслугамЖКХ.НачПериода,
		|	бит_РазовыеПоУслугамЖКХ.КонПериода,
		|	бит_РазовыеПоУслугамЖКХ.Ссылка
		|ИЗ
		|	Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
		|ГДЕ
		|	бит_РазовыеПоУслугамЖКХ.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Данные.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_Данные КАК ВТ_Данные)
		|	И НЕ бит_РазовыеПоУслугамЖКХ.ЛицевойСчет = ЗНАЧЕНИЕ(справочник.бит_ЛицевыеСчета.)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Услуга КАК Услуга,
		|	ВТ_Данные.PER КАК PER,
		|	ВТ_Данные.Сумма КАК Сумма,
		|	ВТ_Данные.Ссылка КАК Ссылка,
		|	ВТ_Данные.F КАК F,
		|	ВТ_Данные.LS КАК LS,
		|	ВТ_Данные.NKV КАК NKV,
		|	ВТ_Данные.DOM КАК DOM,
		|	ВТ_Данные.POD КАК POD,
		|	ВТ_Данные.Период КАК Период,
		|	ВТ_Данные.НомерСтроки КАК НомерСтроки,
		|	ВТ_ФИО.ФизЛицо КАК FIO,
		|	ВТ_ДокДоГруппировки.MAME КАК MAME,
		|	ВТ_ДокДоГруппировки.OT КАК OT,
		|	ВТ_ДокДоГруппировки.DO КАК DO
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИО КАК ВТ_ФИО
		|		ПО ВТ_Данные.LS = ВТ_ФИО.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокДоГруппировки КАК ВТ_ДокДоГруппировки
		|		ПО ВТ_Данные.LS = ВТ_ДокДоГруппировки.ЛицевойСчет
		|			И ВТ_Данные.Ссылка = ВТ_ДокДоГруппировки.Ссылка
		|			И ВТ_Данные.LS = ВТ_ДокДоГруппировки.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документы.F КАК F,
		|	ВТ_Документы.LS КАК LS,
		|	ВТ_Документы.DOM КАК DOM,
		|	ВТ_Документы.NKV КАК NKV,
		|	ВТ_Документы.Период КАК MES,
		|	ВТ_Документы.PER КАК PER,
		|	ВТ_Документы.Период КАК DEN,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &SOD_J
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК SOD_J,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &DM_J
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК DM_J,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга В (&A_J)
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК A_J,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &DOP_JY
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК DOP_JY,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &G_J
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК G_J,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга В (&GV_J)
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК GV_J,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга В (&OT_J)
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК OT_J,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &PR
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК PR,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга В (&XV_J)
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК XV_J,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &VO_J
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК VO_J,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &GP_JY
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК GP_JY,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &PREDS
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК PREDS,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &KAP_DOP
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК KAP_DOP,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &KAP_MIN
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК KAP_MIN,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &RFRK
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК RFRK,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &ODN_VO
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ODN_VO,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &ODN_GV
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ODN_GV,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &ODN_XV
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ODN_XV,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &ODN_EL
		|			ТОГДА ВТ_Документы.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ODN_EL,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &ААС
		|			ТОГДА 1
		|		КОГДА ВТ_Документы.Услуга = &АПТ
		|			ТОГДА 7
		|		КОГДА ВТ_Документы.Услуга = &АГТ
		|			ТОГДА 6
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК KOD_A,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Услуга = &ОтоплениеОКСК
		|			ТОГДА 4
		|		КОГДА ВТ_Документы.Услуга = &ОбслуживаниеПУ
		|			ТОГДА 5
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК KOD_T,
		|	ВТ_Документы.НомерСтроки КАК НомерСтроки,
		|	ВТ_Документы.Ссылка КАК Ссылка,
		|	ВТ_Документы.FIO КАК FIO,
		|	ВТ_Документы.POD КАК POD,
		|	ВТ_Документы.MAME КАК MAME,
		|	ВТ_Документы.OT КАК OT,
		|	ВТ_Документы.DO КАК DO
		|ПОМЕСТИТЬ ВТ_ПоУслугам
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоУслугам.F КАК F,
		|	ВТ_ПоУслугам.LS КАК LS,
		|	ВТ_ПоУслугам.DOM КАК DOM,
		|	ВТ_ПоУслугам.NKV КАК NKV,
		|	ВТ_ПоУслугам.MES КАК MES,
		|	ВТ_ПоУслугам.PER КАК PER,
		|	ВТ_ПоУслугам.DEN КАК DEN,
		|	СУММА(ВТ_ПоУслугам.SOD_J) КАК SOD_J,
		|	СУММА(ВТ_ПоУслугам.DM_J) КАК DM_J,
		|	СУММА(ВТ_ПоУслугам.A_J) КАК A_J,
		|	СУММА(ВТ_ПоУслугам.DOP_JY) КАК DOP_JY,
		|	СУММА(ВТ_ПоУслугам.G_J) КАК G_J,
		|	СУММА(ВТ_ПоУслугам.GV_J) КАК GV_J,
		|	СУММА(ВТ_ПоУслугам.OT_J) КАК OT_J,
		|	СУММА(ВТ_ПоУслугам.PR) КАК PR,
		|	СУММА(ВТ_ПоУслугам.XV_J) КАК XV_J,
		|	СУММА(ВТ_ПоУслугам.VO_J) КАК VO_J,
		|	СУММА(ВТ_ПоУслугам.GP_JY) КАК GP_JY,
		|	СУММА(ВТ_ПоУслугам.PREDS) КАК PREDS,
		|	СУММА(ВТ_ПоУслугам.KAP_DOP) КАК KAP_DOP,
		|	СУММА(ВТ_ПоУслугам.KAP_MIN) КАК KAP_MIN,
		|	СУММА(ВТ_ПоУслугам.RFRK) КАК RFRK,
		|	СУММА(ВТ_ПоУслугам.ODN_VO) КАК ODN_VO,
		|	СУММА(ВТ_ПоУслугам.ODN_GV) КАК ODN_GV,
		|	СУММА(ВТ_ПоУслугам.ODN_XV) КАК ODN_XV,
		|	СУММА(ВТ_ПоУслугам.ODN_EL) КАК ODN_EL,
		|	МАКСИМУМ(ВТ_ПоУслугам.KOD_T) КАК KOD_T,
		|	МАКСИМУМ(ВТ_ПоУслугам.KOD_A) КАК KOD_A,
		|	ВТ_ПоУслугам.Ссылка КАК Ссылка,
		|	ВТ_ПоУслугам.FIO КАК FIO,
		|	ВТ_ПоУслугам.POD КАК POD,
		|	ВТ_ПоУслугам.MAME КАК MAME,
		|	ВТ_ПоУслугам.OT КАК OT,
		|	ВТ_ПоУслугам.DO КАК DO
		|ИЗ
		|	ВТ_ПоУслугам КАК ВТ_ПоУслугам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПоУслугам.F,
		|	ВТ_ПоУслугам.LS,
		|	ВТ_ПоУслугам.NKV,
		|	ВТ_ПоУслугам.MES,
		|	ВТ_ПоУслугам.DEN,
		|	ВТ_ПоУслугам.PER,
		|	ВТ_ПоУслугам.Ссылка,
		|	ВТ_ПоУслугам.FIO,
		|	ВТ_ПоУслугам.DOM,
		|	ВТ_ПоУслугам.POD,
		|	ВТ_ПоУслугам.MAME,
		|	ВТ_ПоУслугам.OT,
		|	ВТ_ПоУслугам.DO
		|
		|УПОРЯДОЧИТЬ ПО
		|	F,
		|	LS,
		|	NKV,
		|	PER";
	
	МассивНачислений = ПолучитьМассивНачислений();
	МассивУчастков = ПолучитьМассивУчастков();
	МассивАдресов = ПолучитьМассивАдресов();
	МассивТиповКвартир = ПолучитьМассивТиповКвартир();
	
	//Запрос.УстановитьПараметр("Адреса", МассивАдресов);
	Если Не МассивАдресов.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ЛицевойСчет.Здание В (&Адреса)");	
		Запрос.УстановитьПараметр("Адреса", МассивАдресов);	
	КонецЕсли; 
	
	//Антенна
	A_J = Новый Массив;
	A_J.Добавить(Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	//A_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000020"));
	//A_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000019"));
	
	//Горячее Водоснабжение
	GV_J = Новый Массив;
	GV_J.Добавить(лб_Сервер.Услуга_ГВ());
	//GV_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000024"));
	
	//Отопление
	OT_J = Новый Массив;
	OT_J.Добавить(Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	//OT_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000025"));
	
	//Холодное Водоснабжение
	XV_J = Новый Массив;
	XV_J.Добавить(лб_Сервер.Услуга_ВО());
	//XV_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000023"));
	
	//Пени
	//P_J = новый Массив;
	//P_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000001"));
	//P_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000003"));
	//P_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000004"));
	//P_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001"));
	
	Запрос.УстановитьПараметр("A_J", A_J);
	Запрос.УстановитьПараметр("DM_J", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000006"));   //домофон 00-000007
	Запрос.УстановитьПараметр("DOP_JY", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000007")); //доп  00-000018
	Запрос.УстановитьПараметр("G_J", Справочники.бит_УслугиЖКХ.ПустаяСсылка());   //
	Запрос.УстановитьПараметр("G_PENI", Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000003"));     //
	Запрос.УстановитьПараметр("GP_JY", Справочники.бит_УслугиЖКХ.ПустаяСсылка());    //
	Запрос.УстановитьПараметр("GV_J", Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	Запрос.УстановитьПараметр("KAP_DOP", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000009"));   //00-000014
	Запрос.УстановитьПараметр("KAP_MIN", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008")); //00-000010
	//Запрос.УстановитьПараметр("KAP_P", Справочники.бит_УслугиЖКХ.НайтиПоКоду("000000001"));
	Запрос.УстановитьПараметр("ODN_EL", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000002")); //00-000010
	Запрос.УстановитьПараметр("ODN_GV", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000003"));  //00-000011
	Запрос.УстановитьПараметр("ODN_VO", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000005"));//ВО 00-000015
	Запрос.УстановитьПараметр("ODN_XV", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000004"));   //
	Запрос.УстановитьПараметр("OT_J", OT_J);
	//Запрос.УстановитьПараметр("P_J", P_J);
	Запрос.УстановитьПараметр("PR", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008"));//одпу 00-000014
	Запрос.УстановитьПараметр("PREDS", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000013"));   //
	Запрос.УстановитьПараметр("RFRK", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000009"));  //
	Запрос.УстановитьПараметр("SOD_J", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001")); //
	Запрос.УстановитьПараметр("VO_J", Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	Запрос.УстановитьПараметр("XV_J", Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	Запрос.УстановитьПараметр("ААС", Справочники.бит_УслугиЖКХ.ПустаяСсылка());    //
	Запрос.УстановитьПараметр("АГТ", Справочники.бит_УслугиЖКХ.ПустаяСсылка());   //
	Запрос.УстановитьПараметр("АПТ", Справочники.бит_УслугиЖКХ.ПустаяСсылка());     //
	Запрос.УстановитьПараметр("ОбслуживаниеПУ", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008"));
	Запрос.УстановитьПараметр("ОтоплениеОКСК", Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начисления", МассивНачислений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Участки", МассивУчастков);
	Запрос.УстановитьПараметр("ТипыКвартир", МассивТиповКвартир);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапка);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");    
	
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлXLSНаКлиенте()
	
	ПолноеИмяФайла = Каталог + "\" + Формат(ТекущаяДата(),"ДФ='dd-MM-yyyy HH.mm.ss'") + ".xlsx";
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ПолноеИмяФайла = Каталог + "\" + ИмяФайла + ".xlsx";	
	КонецЕсли; 
	
	Попытка
		
		ПолучитьФайл(АдресВоВременномХранилище, ПолноеИмяФайла, Ложь);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан файл: " + ПолноеИмяФайла;
		Сообщение.Сообщить();
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеСпособаДетализации()
	
	Если СпособДетализации = "1" Тогда
		Возврат "по участкам";	
	ИначеЕсли СпособДетализации = "2" Тогда 
		Возврат "по адресам";	
	Иначе	
		Возврат "по лицевым счетам";	
	КонецЕсли; 
	
КонецФункции
 
&НаСервере
Функция ПолучитьМассивНачислений()
	
	МассивНачислений = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Начисления.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивНачислений = Начисления.Выгрузить(,"Начисление").ВыгрузитьКолонку("Начисление");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивНачислений.Добавить(НайденнаяСтрока.Начисление);	
		КонецЦикла; 	
	КонецЕсли; 
	
	Возврат МассивНачислений;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивУчастков()
	
	МассивУчастков = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Участки.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивУчастков = Участки.Выгрузить(,"Участок").ВыгрузитьКолонку("Участок");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивУчастков.Добавить(НайденнаяСтрока.Участок);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивУчастков;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивАдресов()
	
	МассивАдресов = Новый Массив;
	
	МассивАдресов = Адреса.Выгрузить(,"Адрес").ВыгрузитьКолонку("Адрес");
	
	Возврат МассивАдресов;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивТиповКвартир()
	
	МассивТиповКвартир = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = ТипыКвартир.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивТиповКвартир = ТипыКвартир.Выгрузить(,"ТипКвартиры").ВыгрузитьКолонку("ТипКвартиры");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивТиповКвартир.Добавить(НайденнаяСтрока.ТипКвартиры);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивТиповКвартир;
	
КонецФункции
